---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarShapeSegment.Dispose
source: html/db64dcf1-c4bd-de56-a66c-90d4d291215b.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeSegment.Dispose Method

Releases all resources used by the RebarShapeSegment

## Syntax (C#)
```csharp
public void Dispose()
```